cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
/*
   Copyright (c) 2024. CRIDP https://github.com/cridp

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

           http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
 */

#include <esp32-hal-gpio.h>
#include <map>
#include "esp_log.h"

#include <iohcRadio.h>
#include <log_buffer.h>
#include <utility>

#include "iohcCozyDevice2W.h"

// trame typique FSK : preamble (variable) + sync (3 B) + header (2 B) + payload (32 B) + CRC (2 B).
// airtime (s) = ( (preamble_bytes + 3 + 2 + payload_bytes + 2) * 8 ) / bitrate
#define LONG_PREAMBLE_MS 64  // 21.458 ms 23~24 1W
#define SHORT_PREAMBLE_MS 16 // 11.458 ms

TaskHandle_t IOHC::iohcRadio::txTaskHandle = nullptr;

// Structure pour gérer un paquet en transmission
struct TxPacketWrapper {
    IOHC::iohcPacket *packet;
    uint8_t repeatsRemaining;
    uint32_t repeatTime;

    explicit TxPacketWrapper(IOHC::iohcPacket *pkt)
        : packet(pkt),
          repeatsRemaining(pkt ? pkt->repeat : 0),
          repeatTime(pkt ? pkt->repeatTime : 0)
          {}

    ~TxPacketWrapper() {
        if (packet) {
            delete packet;
            packet = nullptr;
        }
    }
};

namespace IOHC {
    iohcRadio *iohcRadio::_iohcRadio = nullptr;
    // volatile bool iohcRadio::_g_preamble = false;
    // volatile bool iohcRadio::_g_payload = false;
    volatile uint32_t iohcRadio::_g_payload_millis = 0L;
    uint8_t iohcRadio::_flags[2] = {0, 0};
    volatile bool iohcRadio::f_lock_hop = false;
    volatile bool iohcRadio::send_lock = false;
    volatile bool iohcRadio::txMode = false;
    volatile iohcRadio::RadioState iohcRadio::radioState = iohcRadio::RadioState::IDLE;

    static IOHC::iohcPacket last1wPacket;

    TaskHandle_t handle_interrupt;
    //
    struct RadioIrqEvent {
        uint8_t flags;         // bit0 = preamble, bit1 = payload, autres reserved
        uint32_t ts_ms;        // timestamp en ms (esp_timer_get_time()/1000)
    };

    static QueueHandle_t radioIrqQueue = nullptr;
    static constexpr size_t RADIO_IRQ_QUEUE_LEN = 128;

    /**
    * Aucune prise de sémaphore / lockFHSS() / updateFHSSActivity() ici.
    * esp_timer_get_time() est ISR-safe ; millis() n'est pas garanti ISR-safe dans tous les contextes
    * On utilise donc esp_timer_get_time()/1000.
    */
    void IRAM_ATTR handle_interrupt_fromisr() {
        // Vérification anti-rebond plus robuste
        static uint32_t lastIsrTime = 0;
        uint32_t now = esp_timer_get_time();
        if (now - lastIsrTime < 100) return; // 100µs debounce
        lastIsrTime = now;

        // Lire seulement les GPIOS (opérations très courtes), pas d'appels bloquants
        bool preamble = digitalRead(RADIO_PREAMBLE_DETECTED);
        bool payload  = digitalRead(RADIO_PACKET_AVAIL);

        // Compose l'événement
        RadioIrqEvent ev;
        ev.flags = 0;
        if (preamble) ev.flags |= 0x01;
        if (payload)  ev.flags |= 0x02;
        ev.ts_ms = static_cast<uint32_t>(now / 1000ULL);

        // Envoi dans la queue (FromISR)
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        if (radioIrqQueue) {
            // On ignore si la queue est pleine — compteur de débordement optionnel
            if (xQueueSendFromISR(radioIrqQueue, &ev, &xHigherPriorityTaskWoken) != pdTRUE) {
                // Optionnel : incrémenter un compteur de drops (volatile)
                // irq_drop_count++;
            }
        }
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }

    /**
    * Sequentialité : la task lit la queue et traite chaque événement un à un — plus de réentrance ni d’exécution concurrente.
    * tickerCounter reste proche de ta logique actuelle, mais sans être appelé depuis ISR.
    */
    void handle_interrupt_task(void *pvParameters) {
        IOHC::iohcRadio *radio = static_cast<IOHC::iohcRadio*>(pvParameters);
        RadioIrqEvent ev;
        const TickType_t xMaxBlock = pdMS_TO_TICKS(500); // ou portMAX_DELAY si on veux

        while (true) {
            if (xQueueReceive(radioIrqQueue, &ev, xMaxBlock) == pdTRUE) {
                // traitons l'événement de façon séquentielle (pas de réentrance possible)
                bool preamble = ev.flags & 0x01;
                bool payload  = ev.flags & 0x02;

                if (preamble) {
                    // Relever timestamp et lock dans un contexte sûr
                    radio->lockFHSS(IOHC::iohcRadio::FHSSLockReason::PREAMBLE_DETECTED);
                    radio->updateFHSSActivity(); // écriture atomique safe
                    radio->setRadioState(iohcRadio::RadioState::PREAMBLE);
                }
                if (payload) {
                    // Marquer qu'on est en réception et lock
                    radio->lockFHSS(IOHC::iohcRadio::FHSSLockReason::RECEIVING);
                    radio->updateFHSSActivity();
                    radio->setRadioState(iohcRadio::RadioState::PAYLOAD);
                    // Appeler tickerCounter (qui fait la lecture SPI, receive(), etc.)
                    // tickerCounter tourne en contexte task — donc autorisé à utiliser sémaphores, malloc, etc.
                    radio->tickerCounter(radio);
                }

                // Il se peut que preamble et payload arrivent ensemble : on les gère séquentiellement
            }
            // Boucle continue — pas de busy-wait
        }
    }

    // /**
    //  * Waits for a notification and then calls the `tickerCounter`
    //  * function if certain conditions are met.
    //  *
    //  * @param pvParameters Pointer that can be used to pass any data or object to the task when it is created. In this specific
    //  * function, it is being cast to a pointer of type `iohcRadio` and then passed to the
    //  */
    // void IRAM_ATTR handle_interrupt_task_1(void *pvParameters) {
    //     static uint32_t thread_notification;
    //     constexpr TickType_t xMaxBlockTime = pdMS_TO_TICKS(655 * 4); // 218.4 );
    //     while (true) {
    //         thread_notification = ulTaskNotifyTake(pdTRUE, xMaxBlockTime); // Wait
    //         if (thread_notification &&
    //             (iohcRadio::radioState == iohcRadio::RadioState::PAYLOAD ||
    //              iohcRadio::radioState == iohcRadio::RadioState::PREAMBLE)) {
    //             iohcRadio::tickerCounter(static_cast<iohcRadio *>(pvParameters));
    //         }
    //     }
    // }
    //
    // /**
    //  * Reads digital inputs and notifies a thread to wake up when
    //  * the interrupt service routine is complete.
    //  * lastIsrTime Évite les double-triggers dus à la latence SPI ou à un flag encore haut.
    //  */
    //     static volatile uint32_t lastIsrTime = 0;
    // void IRAM_ATTR handle_interrupt_fromisr_1() {
    //     uint32_t now = micros();
    //     if (now - lastIsrTime < 200) return; // ignore bounce <200µs
    //     lastIsrTime = now;
    //
    //     bool preamble = digitalRead(RADIO_PREAMBLE_DETECTED);
    //     bool payload = digitalRead(RADIO_PACKET_AVAIL);
    //     iohcRadio *radio = iohcRadio::getInstance();
    //     if (preamble) {
    //         // iohcRadio::_g_preamble = true;
    //         // iohcRadio::f_lock_hop = true;
    //         // iohcRadio::setRadioState(iohcRadio::RadioState::PREAMBLE);
    //         // VERROUILLER dès le préambule
    //         // radio->updateFHSSActivity();
    //         radio->lockFHSS(iohcRadio::FHSSLockReason::PREAMBLE_DETECTED);
    //     }
    //     if (payload) {
    //         // iohcRadio::_g_payload = true;
    //         // iohcRadio::setRadioState(iohcRadio::RadioState::PAYLOAD);
    //         // MAINTENIR le verrouillage pour la réception
    //         // radio->updateFHSSActivity();
    //         radio->lockFHSS(iohcRadio::FHSSLockReason::RECEIVING);
    //     }
    //
    //     // Notify the thread so it will wake up when the ISR is complete
    //     BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    //     vTaskNotifyGiveFromISR(handle_interrupt/*_task*/, &xHigherPriorityTaskWoken);
    //     portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    // }

    void FHSSTimer(iohcRadio *iohc_radio) {
        // Vérifier d'abord le timeout
        iohc_radio->checkFHSSTimeout();

        // Si toujours verrouillé, pas de hop
        if (iohc_radio->f_lock_hop) {
            return;
        }

        // Ne sauter que si on est vraiment en RX idle
        if (iohcRadio::radioState != iohcRadio::RadioState::RX) {
            return;
        }

        // Incrémenter l'index de fréquence
        iohc_radio->currentFreqIdx++;
        if (iohc_radio->currentFreqIdx >= iohc_radio->num_freqs) {
            iohc_radio->currentFreqIdx = 0;
        }

