cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        // Verrouiller pour transmission
        radio->lockFHSS(FHSSLockReason::TRANSMITTING);
        txMode = true;

        iohcPacket *pkt = radio->currentTxPacket->packet;

        // Use the frequency of the packet if specified. 1W is always set at CHANNEL2
        if (pkt->frequency == 0) pkt->frequency = radio->scan_freqs[radio->currentFreqIdx];;
        if (pkt->frequency != radio->scan_freqs[radio->currentFreqIdx]) {
            Radio::setCarrier(Radio::Carrier::Frequency, pkt->frequency);
        } else {
            pkt->frequency = radio->scan_freqs[radio->currentFreqIdx];
        }

        Radio::setStandby();
        Radio::clearFlags();
        // Not needed at start as already done at init
        // Radio::setPreambleLength(LONG_PREAMBLE_MS); //repeat?LONG_PREAMBLE_MS:SHORT_PREAMBLE_MS);
        Radio::writeBytes(REG_FIFO, pkt->payload.buffer, pkt->buffer_length);
        Radio::setTx();
        radio->setRadioState(iohcRadio::RadioState::TX);
        // There is no need to maintain radio locked between packets transmission unless clearly asked
        txMode = pkt->lock;

        packetStamp = esp_timer_get_time();
        pkt->decode(true);
        // Memorize last command sent
        IOHC::lastCmd = pkt->cmd();
        // Used for replies in main
        // iohcCozyDevice2W *cozyDevice2W = iohcCozyDevice2W::getInstance();
        // cozyDevice2W->memorizeSend.memorizedCmd = IOHC::lastCmd;
        // cozyDevice2W->memorizeSend.memorizedData = {pkt->payload.buffer+9, pkt->payload.buffer+radio->new_packet->buffer_length};
        // cozyDevice2W->memorizeSend.memorizedData.assign(pkt->payload.buffer+9, pkt->payload.buffer+pkt->buffer_length);
        // Vérifier si ce paquet attend une réponse
        // (vous pouvez ajouter un flag dans iohcPacket pour ça)
        // bool thisPacketExpectsResponse = pkt->expectsResponse;  // À ajouter dans iohcPacket

        if (pkt->repeat > 0) {
            // Only the first frame is LPM (1W)
            pkt->payload.packet.header.CtrlByte2.asStruct.LPM = 0;
            pkt->repeat--;
        }
        if (pkt->repeat == 0) {
            radio->Ticker.detach();

            // Utiliser spinlock au lieu de sémaphore
            uint32_t timeout = esp_timer_get_time() + 50000;  // 50ms en microsecondes
            while (radio->txQueue_busy && esp_timer_get_time() < timeout) {
                // Spinlock court - OK dans ISR
            }

            // Vérifier s'il y a un délai avant le prochain paquet
            bool hasNextPacket = false;
            uint32_t nextDelay = 0;

            // VÉRIFICATION RAPIDE sans modifier la queue
            if (!radio->txQueue_busy && !radio->txQueue.empty()) {
                hasNextPacket = true;
                nextDelay = radio->txQueue.front()->repeatTime;
            }

            if (hasNextPacket && nextDelay > 0) {
                // Délai avant le prochain paquet
                radio->Ticker.delay_ms(nextDelay, processNextPacketCallback, radio);
            } else if (hasNextPacket) {
                // Pas de délai, traiter immédiatement
                radio->processNextPacket();
            } else {
                // Plus de paquets à envoyer
                txMode = false;

                // Si on attend une réponse, GARDER le verrouillage
                // if (thisPacketExpectsResponse) {
                // radio->setExpectingResponse(true, 1000);  // 1 seconde de timeout
                // } else {
                // Sinon déverrouiller
                radio->unlockFHSS(FHSSLockReason::TRANSMITTING);
                // }
                // Plus de paquets, arrêter
                radio->stopTransmission();
            }
        }

        digitalWrite(RX_LED, digitalRead(RX_LED) ^ 1);
    }

    /**
     * Checks if a callback function `txCB` is set and calls
     * it with a packet as a parameter, returning the result.
     *
     * @param packet The `packet` parameter is a pointer to an object of type `iohcPacket`.
     *
     * @return  boolean , which is determined by the result of
     * calling the `txCB` function with the `packet` parameter. If `txCB` is not null, the return value
     * will be the result of calling `txCB(packet)`, otherwise it will be `false`.
     */
    bool IRAM_ATTR iohcRadio::sent(iohcPacket *packet) {
        bool ret = false;
        if (txCB) ret = txCB(packet);
        return ret;
    }

    // La "mémoire tampon" pour le paquet reçu. Elle existe en permanence.
    static iohcPacket rxPacketBuffer;
    // Ajouter des compteurs de performance
    struct RadioStats {
        uint32_t packetsReceived;
        uint32_t packetsSent;
        uint32_t packetsDropped;
        uint32_t queueOverflows;
        uint32_t spiErrors;
    };
    /**
     * Toggles an LED, reads radio data, processes it, and
     * triggers a callback function.
     *
     * @param stats TDetermine whether to gather additional statistics during the radio reception process. If
     * `stats` is set to `true`, the function will collect and process additional information such as RSSI
     *
     * @return Boolean value `true`.
     */
    bool IRAM_ATTR iohcRadio::receive(bool stats = false) {
        digitalWrite(RX_LED, digitalRead(RX_LED) ^ 1);
        // On est déjà verrouillé par l'ISR/tickerCounter

        // 1. OBTENIR UN POINTEUR, SANS ALLOCATION
        // On ne demande pas de nouvelle mémoire. On prend juste l'adresse
        // de notre buffer qui existe déjà. C'est une opération instantanée.
        iohcPacket* currentPacket = &rxPacketBuffer;
        // 2. "NETTOYER" (TRÈS IMPORTANT !)
        // Comme on réutilise le même paquet, il faut le vider de ses anciennes
        // données avant de le remplir avec les nouvelles.
        // Dans la classe iohcPacket.
        currentPacket->reset();
        currentPacket->frequency = scan_freqs[currentFreqIdx];

        _g_payload_millis = esp_timer_get_time();
        packetStamp = _g_payload_millis;

        if (stats) {
            currentPacket->rssi = static_cast<float>(Radio::readByte(REG_RSSIVALUE)) / -2.0f;
            int16_t thres = Radio::readByte(REG_RSSITHRESH);
            currentPacket->snr = currentPacket->rssi > thres ? 0 : (thres - currentPacket->rssi);
            int16_t f = static_cast<uint16_t>(Radio::readByte(REG_AFCMSB));
            f = (f << 8) | static_cast<uint16_t>(Radio::readByte(REG_AFCLSB));
            currentPacket->afc = f * 61.0;
        }

        while (Radio::dataAvail()) {
            if (currentPacket->buffer_length < MAX_FRAME_LEN) {
                currentPacket->payload.buffer[currentPacket->buffer_length++] = Radio::readByte(REG_FIFO);
            } else {
                // ets_printf("Packet overflow %d, max len: %d", currentPacket->buffer_length, MAX_FRAME_LEN);
                // Prevent buffer overflow, discard extra bytes.
                Radio::readByte(REG_FIFO);
            }
        }

        if (*currentPacket == last1wPacket && currentPacket->is1W()) {
            // ets_printf("Same packet, skipping\n");
        } else {
            // if (expectingResponse && isResponsePacket(currentPacket)) {
            //     setExpectingResponse(false);
            //     unlockFHSS(FHSSLockReason::WAITING_RESPONSE);
            // }

            if (rxCB) rxCB(currentPacket);
            currentPacket->decode(true); //stats);
            // addLogMessage(String(currentPacket->decodeToString(true).c_str()));

